export type GalleryItem = {
  image: string;
  title: string;
  guest?: string;
  event?:string;
  date?:string;
};

export const galleryData : Record<string, GalleryItem[]> = {
  

  janmotsav: [

        {
      image: "/images/img10.jpeg",
      title: "संकल्प दिवस",
      guest: " श्री ब्रह्मदेव तिवारी , श्री रमेश मौर्य, श्री अजय पाण्डेय, भाजपा नेता ब्रह्मदेव मिश्रा उत्तर प्रदेश ,  श्री अशोक कुमार पाण्डेय ",
      event: "खाटू श्याम मंदिर बनवाने का संकल्प दिवस",
      date:"23/09/25",
    },
    {
      image: "/images/img7.jpeg",
      title: "संकल्प दिवस",
      guest: "श्री भोला प्रसाद पाण्डेय",
      date:"23/09/25",
        },
    {
      image: "/images/img11.jpeg",
      title: "संकल्प दिवस",
      guest: "प्रधान विजय कुमार",
      date:"23/09/25",
    },
    {
      image: "/images/img6.jpeg",
      title: "संकल्प दिवस",
      guest: "श्री पंकज पाण्डेय , श्री अखिलेश कुमार बिंद",
      date:"23/09/25",
    },
    {
      image: "/images/img12.jpeg",
      title: "संकल्प दिवस",
      guest: "भाजपा नेता श्री ब्रह्मदेव मिश्रा जी , श्री ब्रह्मदेव तिवारी जी , श्री रमेश मौर्य भाजपा नेता",
      date:"23/09/25",
    },
    {
      image: "/images/img13.jpeg",
      title: "संकल्प दिवस",
      guest: "श्री अशोक कुमार पाण्डेय जी",
      date:"23/09/25", 
    },
    {
      image: "/images/img43.jpeg",
      title: "संकल्प दिवस",
      // guest: "श्री DEF जी",
      date:"23/09/25",
    },
    {
      image: "/images/img44.jpeg",
      title: "संकल्प दिवस",
      // guest: "श्री DEF जी",
      date:"23/09/25",
    },
    {
      image: "/images/temple.jpeg",
      title: "संकल्प दिवस",
      // guest: "श्री DEF जी",
      date:"23/09/25",
    },
    {
      image: "/images/img8.jpeg",
      title: "संकल्प दिवस",
      guest: "श्री हरिवंश तिवारी , श्री विनोद तिवारी अधिवक्ता",
      date:"23/09/25",
    },
    {
      image: "/images/img9.jpeg",
      title: "संकल्प दिवस",
      guest: "श्री ब्रह्मदेव तिवारी भाजपा नेता , श्री महेश पाण्डेय",
      date:"23/09/25",
    },
    
    
     {
      image: "/images/img5.jpeg",
      title: "संकल्प दिवस",
      guest: "श्री ब्रह्मदेव मिश्रा , श्री अजय पाण्डेय, श्री अशोक कुमार पाण्डेय ",
      date:"23/09/25",
    },
    {
      image: "/images/img2.jpeg",
      title: "संकल्प दिवस",
      guest: "श्री ब्रह्मदेव मिश्रा भाजपा नेता उत्तर प्रदेश , श्री ब्रह्मदेव तिवारी भाजपा नेता , श्री अजय पाण्डेय , श्री अशोक पाण्डेय",
      date:"23/09/25",
    },
    {
      image: "/images/janmotsav.png",
      title: "जन्मोत्सव",

    },
    {
      image: "/images/img14.jpeg",
      title: "जन्मोत्सव",
      guest: "पूर्व विधायक सुषमा पटेल नीतीश बिंद , रमेश मौर्य , अखिलेश बिंद",
      event: "खाटू श्याम जन्मोत्सव",
      date:"01/11/25",
    },
    {
      image: "/images/img4.jpeg",
      title: "जन्मोत्सव",
      // guest: "श्री DEF जी",
      date:"01/11/25",

    },
   


  ],

  ekadashi: [
    
    {
      image: "/images/img36.jpeg",
      title: "एकादशी",
      guest: "श्री श्री 1008 महामंडलेश्वर स्वामी आत्मानंद सरस्वती पीठाधीश्वर नासिक मठ , विधायक आरके पटेल मरियाहू",
      event: "भजन संध्या आयोजन एकादशी",
      date:"28/02/26",
    },
    {
      image: "/images/img31.jpeg",
      title: "एकादशी",
      guest: "ब्लॉक प्रमुख सुरेंद्र शुक्ला",
      event: "भजन संध्या आयोजन एकादशी",
      date:"28/02/26",
    },
    
    {
      image: "/images/img38.jpeg",
      title: "एकादशी",
      guest: "श्री श्री 1008 महामंडलेश्वर स्वामी आत्मानंद सरस्वती पीठाधीश्वर नासिक मठ , पूर्व विधायक रविंद्र नाथ त्रिपाठी",
      event: "भजन संध्या आयोजन एकादशी",
      date:"28/02/26",

    },
    {
      image: "/images/img30.jpeg",
      title: "एकादशी",
      guest: "पूर्व विधायक पूर्व मंत्री जगदीश सोनकर, अखिलेश बिंद",
      date:"28/02/26",
    },
    {
      image: "/images/img39.jpeg",
      title: "एकादशी",
      guest: "भाजपा नेता ब्रह्मदेव तिवारी",
      event: "भजन संध्या आयोजन एकादशी",
      date:"28/02/26",      
    },
    {
      image: "/images/img41.jpeg",
      title: "एकादशी",
      guest: "श्री श्री 1008 महामंडलेश्वर स्वामी आत्मानंद सरस्वती पीठाधीश्वर नासिक मठ , पूर्व विधायक रविंद्र नाथ त्रिपाठी  , ब्लॉक प्रमुख सुरेंद्र शुक्ला",
      event: "भजन संध्या आयोजन एकादशी",
      date:"28/02/26",
    },
    {
      image: "/images/img33.jpeg",
      title: "एकादशी",
      guest: "श्री ब्रह्मदेव तिवारी , श्री भोलानाथ पाण्डेय , भजन गायक सचिन तिवारी",
      date:"28/02/26",
    },
    {
      image: "/images/img34.jpeg",
      title: "एकादशी",
      guest: "श्री संतोष मिश्रा भाजपा नेता जौनपुर , अजय पाण्डेय",
      date:"28/02/26",
    },
    {
      image: "/images/img35.jpeg",
      title: "एकादशी",
      guest: "श्री ब्रह्मदेव तिवारी ,श्री अजय पाण्डेय कोलकाता",
      date:"28/02/26",
    },
    
    {
      image: "/images/img42.jpeg",
      title: "एकादशी",
      guest:"श्री भोलानाथ पाण्डेय श्री रजनीश लडानिया (कोलकाता) सर्वेश कुमार शुक्ला युवा नेता,ब्रह्मदेव तिवारी , श्री महेंद्र पाण्डेय पूर्व प्रधान",
      date:"28/02/26",
    },
    {
      image: "/images/img37.jpeg",
      title: "एकादशी",
      guest: "श्री श्री 1008 महामंडलेश्वर स्वामी आत्मानंद सरस्वती पीठाधीश्वर नासिक मठ , श्री अजय पाण्डेय (कोलकाता)",
      event: "भजन संध्या आयोजन एकादशी",
      date:"28/02/26",
    },

  ],

  "bhumi-pujan": [
    {
      image: "/images/img24.jpeg",
      title: "भूमि पूजन",
      guest: "मुख्य अतिथि : श्री गिरीश चंद्र यादव जी(उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) )",
      date: "19/04/26",
    },
    {
      image: "/images/img25.jpeg",
      title: "भूमि पूजन",
      guest: "पूर्व विधायिका श्रीमती लीना तिवारी जी",
      date: "19/04/26",
    },
    {
      image: "/images/img21.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी, श्री ब्रह्मदेव मिश्रा जी",
      date: "19/04/26",
    },
    {
      image: "/images/img32.jpeg",
      title: "भूमि पूजन",
      guest: "श्री ब्रह्मदेव तिवारी जी, श्री अजय पाण्डेय जी, श्री अशोक पाण्डेय जी",
      // event: "भजन संध्या आयोजन एकादशी",
      date:"19/04/26",
    },
    {
      image: "/images/img28.jpeg",
      title: "भूमि पूजन",
      guest: "श्री ब्रह्मदेव तिवारी जी, श्रीमती लीना तिवारी जी",
      date: "19/04/26",      
    },
    {
      image: "/images/img4.jpeg",
      title: "भूमि पूजन",
      date: "19/04/26",      
    },
    {
      image: "/images/img18.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) ,पूर्व विधायिका श्रीमती लीना तिवारी जी",
      date: "19/04/26",      
    },
    {
      image: "/images/img19.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) ,श्री ब्रह्मदेव तिवारी जी , श्री अजय पाण्डेय जी",
      date: "19/04/26",      
    },
    {
      image: "/images/img20.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) ,पूर्व विधायिका श्रीमती लीना तिवारी जी, श्री ब्रह्मदेव तिवारी जी ,श्री ब्रह्मदेव मिश्रा जी, श्री अजय पाण्डेय जी",
      date: "19/04/26",      
    },
    {
      image: "/images/img23.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) , श्री ब्रह्मदेव तिवारी जी ,श्री ब्रह्मदेव मिश्रा जी",
      date: "19/04/26",      
    },
    {
      image: "/images/img27.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) ,पूर्व विधायिका श्रीमती लीना तिवारी जी, श्री ब्रह्मदेव तिवारी जी ",
      date: "19/04/26",
    },
    {
      image: "/images/img29.jpeg",
      title: "भूमि पूजन",
      guest: "पूर्व विधायिका श्रीमती लीना तिवारी जी, श्री ब्रह्मदेव तिवारी जी , श्री विनोद तिवारी अधिवक्ता",
      date: "19/04/26",
      
    },
        {
      image: "/images/img22.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) ,पूर्व विधायिका श्रीमती लीना तिवारी जी, श्री ब्रह्मदेव तिवारी जी , श्री पंकज पाण्डेय जी",
      date: "19/04/26",      
    },
    {
      image: "/images/img26.jpeg",
      title: "भूमि पूजन",
      guest: "श्री गिरीश चंद्र यादव जी उत्तर प्रदेश के राज्यमंत्री (स्वतंत्र प्रभार) ,पूर्व विधायिका श्रीमती लीना तिवारी जी, श्री ब्रह्मदेव तिवारी जी ",
      date: "19/04/26",      
    },
  ],
};